toitlang/toit/src/resources/spi_esp32.cc
// Copyright (C) 2018 Toitware ApS.
//
// This library is free software; you can redistribute it and/or
// modify it under the terms of the GNU Lesser General Public
// License as published by the Free Software Foundation; version
// 2.1 only.
//
// This library is distributed in the hope that it will be useful,
// but WITHOUT ANY WARRANTY; without even the implied warranty of
// MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
// Lesser General Public License for more details.
//
// The license can be found in the file `LICENSE` in the top level
// directory of this repository.

#include "../top.h"

#ifdef TOIT_ESP32

#include <driver/gpio.h>
#include <driver/spi_master.h>
#ifdef CONFIG_TOIT_ENABLE_SPI_TARGET
#include <driver/spi_slave.h>
#include <esp_private/spi_slave_internal.h>
#include <soc/soc_caps.h>
#if SOC_CACHE_INTERNAL_MEM_VIA_L1CACHE
#ifdef CONFIG_TOIT_ENABLE_SPI_BUFFER_TARGET
#include <esp_cache.h>
#endif
#include <hal/cache_hal.h>
#include <hal/cache_ll.h>
#endif
#endif
#include <esp_heap_caps.h>

#include "../objects_inline.h"
#include "../process.h"
#include "../resource.h"
#include "../resource_pool.h"
#include "../vm.h"

#include "../event_sources/system_esp32.h"
#include "../event_sources/ev_queue_esp32.h"

#include "spi_esp32.h"

namespace toit {

static_assert(kSpiControllerMaxDevicesPerHost * (SOC_SPI_PERIPH_NUM - 1) <=
                  SPI_EVENT_QUEUE_SIZE,
              "Increase SPI_EVENT_QUEUE_SIZE");

const spi_host_device_t kInvalidHostDevice = spi_host_device_t(-1);

static ResourcePool<spi_host_device_t, kInvalidHostDevice> spi_host_devices(
  // SPI1_HOST is typically reserved for flash and spiram.
  SPI2_HOST
#if SOC_SPI_PERIPH_NUM > 2
  , SPI3_HOST
#endif
);

static uint8_t* allocate_dma_buffer(size_t size, size_t alignment) {
  if (size == 0) return null;
  size_t allocation_size = (size + alignment - 1) & ~(alignment - 1);
  if (allocation_size < size) return null;
  return static_cast<uint8_t*>(heap_caps_aligned_alloc(
      alignment,
      allocation_size,
      MALLOC_CAP_INTERNAL | MALLOC_CAP_DMA | MALLOC_CAP_8BIT));
}

#ifdef CONFIG_TOIT_ENABLE_SPI_TARGET

const word kSpiTargetReadyState = 1 << 0;
const word kSpiTargetDoneState = 1 << 1;
const int64 kSpiTargetTeardownTimeoutUs = 10 * 1000 * 1000;
#ifdef CONFIG_TOIT_ENABLE_SPI_BUFFER_TARGET
const size_t kSpiBufferTargetMaxTransferSize = 4092;
const word kSpiBufferTargetReceivedState = 1 << 2;
const word kSpiBufferTargetStoppedState = 1 << 3;
const word kSpiBufferTargetArmedState = 1 << 4;
#endif

static size_t spi_dma_buffer_alignment(bool dma) {
  if (!dma) return 4;
#if SOC_CACHE_INTERNAL_MEM_VIA_L1CACHE
  size_t cache_line_size =
      cache_hal_get_cache_line_size(CACHE_LL_LEVEL_INT_MEM, CACHE_TYPE_DATA);
  if (cache_line_size != 0) return cache_line_size;
#endif
  return 4;
}

#if CONFIG_SPI_SLAVE_ISR_IN_IRAM
#define SPI_TARGET_ISR_ATTR IRAM_ATTR
#else
#define SPI_TARGET_ISR_ATTR
#endif

class SpiTargetResourceGroup : public ResourceGroup {
 public:
  TAG(SpiTargetResourceGroup);

  SpiTargetResourceGroup(Process* process, EventSource* event_source)
      : ResourceGroup(process, event_source) {}

  uint32_t on_event(Resource* resource, word data, uint32_t state) override {
    return state | data;
  }
};

struct SpiTargetConfig {
  int mosi;
  int miso;
  int clock;
  int cs;
  size_t max_transfer_size;
  int mode;
  bool transmit_lsb_first;
  bool receive_lsb_first;
  bool dma;
  slave_transaction_cb_t armed_callback;
  slave_transaction_cb_t done_callback;
};

class SpiTargetResourceBase : public EventQueueResource {
 public:
  SpiTargetResourceBase(SpiTargetResourceGroup* group,
                        spi_host_device_t host_device,
                        QueueHandle_t event_queue)
      : EventQueueResource(group, event_queue)
      , host_device_(host_device) {}
  ~SpiTargetResourceBase() override;

  spi_host_device_t host_device() const { return host_device_; }
  GpioPins& owned_pins() { return owned_pins_; }

  esp_err_t initialize_driver(const SpiTargetConfig& config);

 protected:
  bool initialized() const { return initialized_; }
  void release_driver(spi_slave_transaction_t* transaction,
                      bool abort_requested = false);

 private:
  spi_host_device_t host_device_;
  bool initialized_ = false;
  GpioPins owned_pins_;
};

class SpiTargetResource : public SpiTargetResourceBase {
 public:
  TAG(SpiTargetResource);

  SpiTargetResource(SpiTargetResourceGroup* group,
                    spi_host_device_t host_device,
                    QueueHandle_t event_queue,
                    size_t max_transfer_size,
                    size_t buffer_alignment,
                    bool dma,
                    bool transmit_enabled)
      : SpiTargetResourceBase(group, host_device, event_queue)
      , max_transfer_size_(max_transfer_size)
      , buffer_alignment_(buffer_alignment)
      , dma_(dma)
      , transmit_enabled_(transmit_enabled) {}

  ~SpiTargetResource() override;

  size_t max_transfer_size() const { return max_transfer_size_; }
  size_t buffer_alignment() const { return buffer_alignment_; }

  bool operation_in_flight() const { return operation_in_flight_; }
  spi_slave_transaction_t* transaction() { return &transaction_; }

  void prepare_operation(uint8_t* tx_buffer,
                         uint8_t* rx_buffer,
                         size_t receive_size,
                         size_t transfer_size);
  void finish_operation();

  uint8_t* receive_buffer() const { return rx_buffer_; }
  size_t receive_size() const { return receive_size_; }
  size_t transferred_bits() const { return transaction_.trans_len; }
  bool dma() const { return dma_; }
  bool transmit_enabled() const { return transmit_enabled_; }

  SPI_TARGET_ISR_ATTR void ready_from_isr() { signal_from_isr(kSpiTargetReadyState); }
  SPI_TARGET_ISR_ATTR void complete_from_isr() { signal_from_isr(kSpiTargetDoneState); }

  bool receive_event(word* data) override {
    return xQueueReceive(queue(), data, 0) == pdTRUE;
  }

