toitlang/toit/src/resources/spi_esp32.cc
 private:
  SPI_TARGET_ISR_ATTR void signal_from_isr(word event) {
    BaseType_t higher_was_woken = pdFALSE;
    xQueueSendFromISR(queue(), &event, &higher_was_woken);
    if (higher_was_woken == pdTRUE) portYIELD_FROM_ISR();
  }

  const size_t max_transfer_size_;
  const size_t buffer_alignment_;
  const bool dma_;
  const bool transmit_enabled_;
  bool operation_in_flight_ = false;
  spi_slave_transaction_t transaction_ = {};
  uint8_t* tx_buffer_ = null;
  uint8_t* rx_buffer_ = null;
  size_t receive_size_ = 0;
};

#ifdef CONFIG_TOIT_ENABLE_SPI_BUFFER_TARGET

class SpiBufferTargetResource : public SpiTargetResourceBase {
 public:
  TAG(SpiBufferTargetResource);

  SpiBufferTargetResource(SpiTargetResourceGroup* group,
                          spi_host_device_t host_device,
                          QueueHandle_t event_queue,
                          uint8_t* response_buffer,
                          uint8_t* receive_storage,
                          uint32_t* receive_indices,
                          uint32_t* receive_lengths,
                          uint32_t* free_receive_indices,
                          size_t buffer_size,
                          size_t driver_buffer_size,
                          uint32_t receive_queue_depth,
                          bool dma);
  ~SpiBufferTargetResource() override;

  spi_slave_transaction_t* transaction() { return &transaction_; }

  bool can_receive() const { return receive_storage_ != null; }
  bool can_transmit() const { return response_buffer_ != null; }
  size_t buffer_size() const { return buffer_size_; }

  int get_response(uint32_t index) const;
  void set_response(uint32_t index, uint8_t value);
  void read_response(uint32_t index, uint8_t* destination, uint32_t length) const;
  void write_response(uint32_t index, const uint8_t* source, uint32_t length);

  // Returns the received byte count, -1 when the queue is empty, and -2 when
  // the native transaction could not be re-armed.
  int take_receive(uint8_t* destination);
  word dropped_receive_count() const;
  // Returns whether a completion callback will report the stopped state.
  bool request_abort();

  SPI_TARGET_ISR_ATTR void armed_from_isr();
  SPI_TARGET_ISR_ATTR void complete_from_isr();

  bool receive_event(word* data) override;

 private:
  SPI_TARGET_ISR_ATTR void signal_from_isr(word event);

  uint8_t* response_buffer_;
  uint8_t* receive_storage_;
  uint32_t* receive_indices_;
  uint32_t* receive_lengths_;
  uint32_t* free_receive_indices_;
  const size_t buffer_size_;
  const size_t driver_buffer_size_;
  const uint32_t receive_queue_depth_;
  const bool dma_;
  spi_slave_transaction_t transaction_ = {};
  mutable spinlock_t spinlock_;
  uint32_t receive_head_ = 0;
  uint32_t receive_count_ = 0;
  uint32_t free_receive_count_ = 0;
  uint32_t active_receive_index_ = 0;
  word dropped_receive_count_ = 0;
  bool response_dirty_ = false;
  bool requeue_failed_ = false;
  bool stopping_ = false;
  bool initially_armed_ = false;
  word pending_event_ = 0;
};

#endif  // CONFIG_TOIT_ENABLE_SPI_BUFFER_TARGET

#endif  // CONFIG_TOIT_ENABLE_SPI_TARGET

SpiResourceGroup::SpiResourceGroup(Process* process,
                                   EventSource* event_source,
                                   spi_host_device_t host_device,
                                   bool half_duplex)
    : ResourceGroup(process, event_source)
    , host_device_(host_device)
    , half_duplex_(half_duplex) {}

SpiResourceGroup::~SpiResourceGroup() {
  SystemEventSource::instance()->run([&]() -> void {
    FATAL_IF_NOT_ESP_OK(spi_bus_free(host_device_));
  });
  spi_host_devices.put(host_device_);
  // Release any GPIO pins this bus reserved (mosi/miso/clock).
  owned_pins_.release();
}

SpiDevice::~SpiDevice() {
  if (operation_in_flight_) {
    spi_transaction_t* completed = null;
    FATAL_IF_NOT_ESP_OK(spi_device_get_trans_result(
        handle_, &completed, portMAX_DELAY));
    ASSERT(completed == transaction());
    finish_operation();
  }
  if (bus_acquired_) spi_device_release_bus(handle_);
  FATAL_IF_NOT_ESP_OK(spi_bus_remove_device(handle_));
  vQueueDeleteWithCaps(queue());
  // Release any GPIO pins this device reserved (cs/dc).
  owned_pins_.release();
}

void SpiDevice::prepare_operation(const uint8_t* tx_data,
                                  uint8_t* tx_buffer,
                                  uint8_t* rx_buffer,
                                  size_t transfer_size,
                                  uint32_t flags,
                                  uint16_t command,
                                  uint64_t address) {
  ASSERT(!operation_in_flight_);
  tx_buffer_ = tx_buffer;
  rx_buffer_ = rx_buffer;
  transfer_size_ = transfer_size;
  transaction_ = {
    .flags = flags,
    .cmd = command,
    .addr = address,
    .length = transfer_size * 8,
    .rxlength = 0,
    .user = this,
    .tx_buffer = tx_buffer,
    .rx_buffer = rx_buffer,
  };
  if (transfer_size != 0 && tx_buffer == null) {
    ASSERT(transfer_size <= sizeof(transaction_.tx_data));
    transaction_.flags |= SPI_TRANS_USE_TXDATA;
    memcpy(transaction_.tx_data, tx_data, transfer_size);
  }
  operation_in_flight_ = true;
}

void SpiDevice::finish_operation() {
  ASSERT(operation_in_flight_);
  free(tx_buffer_);
  free(rx_buffer_);
  tx_buffer_ = null;
  rx_buffer_ = null;
  transfer_size_ = 0;
  transaction_ = {};
  operation_in_flight_ = false;
}

void SpiDevice::complete_from_isr() {
  BaseType_t higher_was_woken = pdFALSE;
  word event = kSpiControllerDoneState;
  xQueueSendFromISR(queue(), &event, &higher_was_woken);
  if (higher_was_woken == pdTRUE) portYIELD_FROM_ISR();
}

bool SpiDevice::receive_event(word* data) {
  return xQueueReceive(queue(), data, 0) == pdTRUE;
}

#ifdef CONFIG_TOIT_ENABLE_SPI_TARGET

SpiTargetResourceBase::~SpiTargetResourceBase() {
  ASSERT(!initialized_);
  vQueueDeleteWithCaps(queue());
  spi_host_devices.put(host_device_);
  owned_pins_.release();
}

esp_err_t SpiTargetResourceBase::initialize_driver(
    const SpiTargetConfig& config) {
  ASSERT(!initialized_);

