toitlang/toit/src/resources/spi_esp32.cc
  spi_bus_config_t bus_config = {};
  bus_config.mosi_io_num = config.mosi;
  bus_config.miso_io_num = config.miso;
  bus_config.sclk_io_num = config.clock;
  bus_config.quadwp_io_num = -1;
  bus_config.quadhd_io_num = -1;
  bus_config.max_transfer_sz = static_cast<int>(config.max_transfer_size);
  bus_config.flags = 0;
#if CONFIG_SPI_SLAVE_ISR_IN_IRAM
  bus_config.intr_flags = ESP_INTR_FLAG_IRAM;
#else
  bus_config.intr_flags = 0;
#endif

  uint32_t flags = SPI_SLAVE_NO_RETURN_RESULT;
  if (config.transmit_lsb_first) flags |= SPI_SLAVE_TXBIT_LSBFIRST;
  if (config.receive_lsb_first) flags |= SPI_SLAVE_RXBIT_LSBFIRST;
  spi_slave_interface_config_t target_config = {
    .spics_io_num = config.cs,
    .flags = flags,
    .queue_size = 1,
    .mode = static_cast<uint8_t>(config.mode),
    .post_setup_cb = config.armed_callback,
    .post_trans_cb = config.done_callback,
  };

  // CS is active low. Keep it inactive while the peer has not configured its
  // controller pin yet; otherwise a floating edge can complete a descriptor
  // before any clocks have been received.
  esp_err_t err = gpio_set_pull_mode(
      static_cast<gpio_num_t>(config.cs), GPIO_PULLUP_ONLY);
  if (err != ESP_OK) return err;

  err = spi_slave_initialize(
      host_device_,
      &bus_config,
      &target_config,
      config.dma ? SPI_DMA_CH_AUTO : SPI_DMA_DISABLED);
  if (err == ESP_OK) initialized_ = true;
  return err;
}

void SpiTargetResourceBase::release_driver(
    spi_slave_transaction_t* transaction, bool abort_requested) {
  ASSERT(initialized_);
  if (transaction == null) {
    FATAL_IF_NOT_ESP_OK(spi_slave_free(host_device_));
    initialized_ = false;
    return;
  }

  // Process teardown is outside the scheduler's deadlock detection. Bound the
  // wait locally in case the driver or its ISR stops making progress.
  int64 teardown_deadline =
      OS::get_monotonic_time() + kSpiTargetTeardownTimeoutUs;
  while (true) {
    if (!abort_requested) {
      esp_err_t abort_error =
          spi_slave_abort_transaction(host_device_, transaction);
      if (abort_error == ESP_OK) {
        abort_requested = true;
      } else if (abort_error != ESP_ERR_INVALID_STATE) {
        FATAL_IF_NOT_ESP_OK(abort_error);
      }
    }
    esp_err_t free_error = spi_slave_free(host_device_);
    if (free_error == ESP_OK) {
      initialized_ = false;
      return;
    }
    if (free_error != ESP_ERR_INVALID_STATE) {
      FATAL_IF_NOT_ESP_OK(free_error);
    }
    if (OS::get_monotonic_time() >= teardown_deadline) {
      FATAL("Timed out tearing down SPI target");
    }
    vTaskDelay(1);
  }
}

SpiTargetResource::~SpiTargetResource() {
  if (initialized()) {
    // Process teardown can bypass Target.close. Abort and wait for the driver
    // to retire the mounted descriptor before releasing its buffers. Ordinary
    // close rejects an in-flight transfer.
    release_driver(operation_in_flight_ ? transaction() : null);
  }
  if (operation_in_flight_) finish_operation();
}

void SpiTargetResource::prepare_operation(uint8_t* tx_buffer,
                                          uint8_t* rx_buffer,
                                          size_t receive_size,
                                          size_t transfer_size) {
  ASSERT(!operation_in_flight_);
  tx_buffer_ = tx_buffer;
  rx_buffer_ = rx_buffer;
  receive_size_ = receive_size;
  transaction_ = {
    .flags = 0,
    .length = transfer_size * 8,
    .trans_len = 0,
    .tx_buffer = tx_buffer,
    .rx_buffer = rx_buffer,
    .user = this,
  };
  operation_in_flight_ = true;
}

void SpiTargetResource::finish_operation() {
  ASSERT(operation_in_flight_);
  free(tx_buffer_);
  free(rx_buffer_);
  tx_buffer_ = null;
  rx_buffer_ = null;
  receive_size_ = 0;
  transaction_ = {};
  operation_in_flight_ = false;
}

#ifdef CONFIG_TOIT_ENABLE_SPI_BUFFER_TARGET

SpiBufferTargetResource::SpiBufferTargetResource(
    SpiTargetResourceGroup* group,
    spi_host_device_t host_device,
    QueueHandle_t event_queue,
    uint8_t* response_buffer,
    uint8_t* receive_storage,
    uint32_t* receive_indices,
    uint32_t* receive_lengths,
    uint32_t* free_receive_indices,
    size_t buffer_size,
    size_t driver_buffer_size,
    uint32_t receive_queue_depth,
    bool dma)
    : SpiTargetResourceBase(group, host_device, event_queue)
    , response_buffer_(response_buffer)
    , receive_storage_(receive_storage)
    , receive_indices_(receive_indices)
    , receive_lengths_(receive_lengths)
    , free_receive_indices_(free_receive_indices)
    , buffer_size_(buffer_size)
    , driver_buffer_size_(driver_buffer_size)
    , receive_queue_depth_(receive_queue_depth)
    , dma_(dma) {
  spinlock_initialize(&spinlock_);
  if (receive_storage_ != null) {
    free_receive_count_ = receive_queue_depth_;
    for (uint32_t i = 0; i < receive_queue_depth_; i++) {
      free_receive_indices_[i] = i + 1;
    }
  }
  transaction_ = {
    .flags = 0,
    .length = driver_buffer_size * 8,
    .trans_len = 0,
    .tx_buffer = response_buffer,
    .rx_buffer = receive_storage,
    .user = this,
  };
}

SpiBufferTargetResource::~SpiBufferTargetResource() {
  if (initialized()) {
    // Normal close has already retired the continuously armed descriptor.
    // Process teardown can arrive first, so drive the same asynchronous abort
    // to completion before releasing buffers referenced by the ISR.
    bool abort_requested = !stopping_ && request_abort();
    release_driver(transaction(), abort_requested);
  }
  free(response_buffer_);
  free(receive_storage_);
  free(receive_indices_);
  free(receive_lengths_);
  free(free_receive_indices_);
}

int SpiBufferTargetResource::get_response(uint32_t index) const {
  portENTER_CRITICAL(&spinlock_);
  int result = response_buffer_[index];
  portEXIT_CRITICAL(&spinlock_);
  return result;
}

void SpiBufferTargetResource::set_response(uint32_t index, uint8_t value) {
  portENTER_CRITICAL(&spinlock_);
  response_buffer_[index] = value;
  response_dirty_ = true;
  portEXIT_CRITICAL(&spinlock_);
}

void SpiBufferTargetResource::read_response(
    uint32_t index, uint8_t* destination, uint32_t length) const {
  for (uint32_t i = 0; i < length; i++) {
    portENTER_CRITICAL(&spinlock_);
    destination[i] = response_buffer_[index + i];
    portEXIT_CRITICAL(&spinlock_);
  }
}

void SpiBufferTargetResource::write_response(
    uint32_t index, const uint8_t* source, uint32_t length) {
  for (uint32_t i = 0; i < length; i++) {
    portENTER_CRITICAL(&spinlock_);
    response_buffer_[index + i] = source[i];
    response_dirty_ = true;
    portEXIT_CRITICAL(&spinlock_);
  }
}

int SpiBufferTargetResource::take_receive(uint8_t* destination) {
  portENTER_CRITICAL(&spinlock_);
  if (receive_count_ == 0) {
    int result = requeue_failed_ ? -2 : -1;
    portEXIT_CRITICAL(&spinlock_);
    return result;
  }
  uint32_t queue_index = receive_head_;
  uint32_t buffer_index = receive_indices_[queue_index];
  uint32_t length = receive_lengths_[queue_index];
  // Keep the slot counted while copying so the ISR cannot reuse it. This can
  // temporarily make a full queue drop one more transaction, but avoids
  // disabling interrupts for a potentially large managed-memory copy.
  portEXIT_CRITICAL(&spinlock_);
  memcpy(destination,
         receive_storage_ + buffer_index * driver_buffer_size_,
         length);

  portENTER_CRITICAL(&spinlock_);
  ASSERT(free_receive_count_ < receive_queue_depth_);
  free_receive_indices_[free_receive_count_++] = buffer_index;
  receive_head_++;
  if (receive_head_ == receive_queue_depth_) receive_head_ = 0;
  receive_count_--;
  portEXIT_CRITICAL(&spinlock_);
  return length;
}

