toitlang/toit/src/resources/spi_esp32.cc
word SpiBufferTargetResource::dropped_receive_count() const {
  portENTER_CRITICAL(&spinlock_);
  word result = dropped_receive_count_;
  portEXIT_CRITICAL(&spinlock_);
  return result;
}

bool SpiBufferTargetResource::request_abort() {
  portENTER_CRITICAL(&spinlock_);
  ASSERT(!stopping_);
  stopping_ = true;
  portEXIT_CRITICAL(&spinlock_);

  esp_err_t err = spi_slave_abort_transaction(host_device(), &transaction_);
  // ESP_ERR_INVALID_STATE means that natural completion won the race. The
  // callback observes stopping_ and signals kSpiBufferTargetStoppedState
  // without re-arming the descriptor.
  if (err == ESP_ERR_INVALID_STATE) return false;
  FATAL_IF_NOT_ESP_OK(err);
  return true;
}

void SpiBufferTargetResource::armed_from_isr() {
  portENTER_CRITICAL_ISR(&spinlock_);
  bool signal = !initially_armed_;
  initially_armed_ = true;
  portEXIT_CRITICAL_ISR(&spinlock_);
  if (signal) signal_from_isr(kSpiBufferTargetArmedState);
}

void SpiBufferTargetResource::complete_from_isr() {
  size_t received = (transaction_.trans_len + 7) / 8;
  if (received > buffer_size_) received = buffer_size_;
#if CONFIG_IDF_TARGET_ESP32
  // Classic ESP32 target DMA only commits complete words to its receive
  // buffer. ESP-IDF documents that a controller's trailing bytes are
  // discarded when its transaction length is not a multiple of four.
  if (dma_) received &= ~static_cast<size_t>(3);
#endif
  bool enqueued = false;
  bool failed = false;
#if SOC_CACHE_INTERNAL_MEM_VIA_L1CACHE
  bool sync_response = false;
#endif

  portENTER_CRITICAL_ISR(&spinlock_);
  if (stopping_) {
    portEXIT_CRITICAL_ISR(&spinlock_);
    signal_from_isr(kSpiBufferTargetStoppedState);
    return;
  }
  // A floating or newly configured CS line can produce an interrupt without
  // any clock edges. It carries no transaction data, so don't consume receive
  // queue capacity or wake a receiver for it.
  if (receive_storage_ != null && received != 0) {
    if (free_receive_count_ != 0) {
      uint32_t queue_index = receive_head_ + receive_count_;
      if (queue_index >= receive_queue_depth_) queue_index -= receive_queue_depth_;
      receive_indices_[queue_index] = active_receive_index_;
      receive_lengths_[queue_index] = received;
      active_receive_index_ = free_receive_indices_[--free_receive_count_];
      transaction_.rx_buffer =
          receive_storage_ + active_receive_index_ * driver_buffer_size_;
      receive_count_++;
      enqueued = true;
    } else if (dropped_receive_count_ != Smi::MAX_SMI_VALUE) {
      dropped_receive_count_++;
    }
  }
#if SOC_CACHE_INTERNAL_MEM_VIA_L1CACHE
  sync_response = response_dirty_;
  response_dirty_ = false;
#endif
  portEXIT_CRITICAL_ISR(&spinlock_);

#if SOC_CACHE_INTERNAL_MEM_VIA_L1CACHE
  // The response is already DMA-readable until Toit changes it. Avoid an
  // unconditional full-buffer cache writeback on every transaction.
  if (sync_response && dma_ && response_buffer_ != null) {
    esp_err_t err = esp_cache_msync(
        response_buffer_, driver_buffer_size_, ESP_CACHE_MSYNC_FLAG_DIR_C2M);
    if (err != ESP_OK) failed = true;
  }
#endif

  portENTER_CRITICAL_ISR(&spinlock_);
  if (stopping_) {
    portEXIT_CRITICAL_ISR(&spinlock_);
    signal_from_isr(kSpiBufferTargetStoppedState);
    return;
  }
  transaction_.trans_len = 0;
  if (!failed) {
    esp_err_t err = spi_slave_queue_trans_isr(host_device(), &transaction_);
    if (err != ESP_OK) failed = true;
  }
  if (failed) {
    requeue_failed_ = true;
  }
  // Keep the decision to re-arm atomic with request_abort. If close sets
  // stopping_ first, this callback does not re-arm. If this callback wins, it
  // queues the descriptor before close can ask ESP-IDF to abort it.
  portEXIT_CRITICAL_ISR(&spinlock_);

  if (enqueued || failed) signal_from_isr(kSpiBufferTargetReceivedState);
}

bool SpiBufferTargetResource::receive_event(word* data) {
  word unused;
  if (xQueueReceive(queue(), &unused, 0) != pdTRUE) return false;
  portENTER_CRITICAL(&spinlock_);
  *data = pending_event_;
  pending_event_ = 0;
  portEXIT_CRITICAL(&spinlock_);
  return true;
}

void SpiBufferTargetResource::signal_from_isr(word event) {
  BaseType_t higher_was_woken = pdFALSE;
  portENTER_CRITICAL_ISR(&spinlock_);
  pending_event_ |= event;
  portEXIT_CRITICAL_ISR(&spinlock_);
  word payload = 0;
  xQueueSendFromISR(queue(), &payload, &higher_was_woken);
  if (higher_was_woken == pdTRUE) portYIELD_FROM_ISR();
}

#endif  // CONFIG_TOIT_ENABLE_SPI_BUFFER_TARGET

#endif  // CONFIG_TOIT_ENABLE_SPI_TARGET

MODULE_IMPLEMENTATION(spi, MODULE_SPI);

PRIMITIVE(init) {
  ARGS(int, mosi, int, miso, int, clock);

  ByteArray* proxy = process->object_heap()->allocate_proxy();
  if (proxy == null) FAIL(ALLOCATION_FAILED);

  // Decode the pins and reserve them from the shared
  // pool. The reserver releases everything again if we leave without `keep()`.
  GpioPinReserver reserver;
  bool reserve_ok = true;
  int mosi_num = reserver.decode_and_take(mosi, &reserve_ok);
  int miso_num = reserver.decode_and_take(miso, &reserve_ok);
  int clock_num = reserver.decode_and_take(clock, &reserve_ok);
  if (!reserve_ok) FAIL(ALREADY_IN_USE);

  spi_host_device_t host_device = kInvalidHostDevice;

  // Check if there is a preferred device.
  // TODO(florian): match against the preferred pins for each device.
  if ((mosi_num == -1 || mosi_num == 13) &&
      (miso_num == -1 || miso_num == 12) &&
      (clock_num == -1 || clock_num == 14)) {
    host_device = SPI2_HOST;
  }
#if SOC_SPI_PERIPH_NUM > 2
  if ((mosi_num == -1 || mosi_num == 23) &&
      (miso_num == -1 || miso_num == 19) &&
      (clock_num == -1 || clock_num == 18)) {
    host_device = SPI3_HOST;
  }
#endif
  host_device = spi_host_devices.preferred(host_device);
  if (host_device == kInvalidHostDevice) FAIL(ALREADY_IN_USE);

  spi_bus_config_t conf = {};
  conf.mosi_io_num = mosi_num;
  conf.miso_io_num = miso_num;
  conf.sclk_io_num = clock_num;
  conf.quadwp_io_num = -1;
  conf.quadhd_io_num = -1;
  conf.max_transfer_sz = 0;
  conf.flags = 0;
#if CONFIG_SPI_MASTER_ISR_IN_IRAM
  conf.intr_flags = ESP_INTR_FLAG_IRAM;
#else
  conf.intr_flags = 0;
#endif
  CAPTURE2(spi_host_device_t, host_device, spi_bus_config_t, conf);
  esp_err_t err = ESP_OK;
  SystemEventSource::instance()->run([&]() -> void {
    err = spi_bus_initialize(capture.host_device, &capture.conf, SPI_DMA_CH_AUTO);
  });
  if (err != ESP_OK) {
    spi_host_devices.put(host_device);
    return Primitive::os_error(err, process);
  }

  SpiResourceGroup* spi = _new SpiResourceGroup(
      process,
      EventQueueEventSource::instance(),
      host_device,
      mosi_num == -1 || miso_num == -1);
  if (!spi) {
    SystemEventSource::instance()->run([&]() -> void {
      FATAL_IF_NOT_ESP_OK(spi_bus_free(capture.host_device));
    });
    spi_host_devices.put(host_device);
    FAIL(MALLOC_FAILED);
  }

  // The reservation now belongs to the resource and is released on close.
  spi->owned_pins().adopt(reserver);
  reserver.keep();

  proxy->set_external_address(spi);

  return proxy;
}

#ifdef CONFIG_TOIT_ENABLE_SPI_TARGET

PRIMITIVE(target_init) {
  ByteArray* proxy = process->object_heap()->allocate_proxy();
  if (proxy == null) FAIL(ALLOCATION_FAILED);

  auto group = _new SpiTargetResourceGroup(
      process, EventQueueEventSource::instance());
  if (group == null) FAIL(MALLOC_FAILED);

  proxy->set_external_address(group);
  return proxy;
}

SPI_TARGET_ISR_ATTR static void spi_target_done_callback(spi_slave_transaction_t* transaction) {
  auto resource = static_cast<SpiTargetResource*>(transaction->user);
  resource->complete_from_isr();
}

SPI_TARGET_ISR_ATTR static void spi_target_ready_callback(spi_slave_transaction_t* transaction) {
  auto resource = static_cast<SpiTargetResource*>(transaction->user);
  resource->ready_from_isr();
}

PRIMITIVE(target_create) {
  ARGS(SpiTargetResourceGroup, group,
       int, mosi,
       int, miso,
       int, clock,
       int, cs,
       int, mode,
       bool, transmit_lsb_first,
       bool, receive_lsb_first,
       uint32, max_transfer_size,
       bool, dma);

