toitlang/toit/src/resources/spi_esp32.cc
  if (mode < 0 || mode > 3 || max_transfer_size == 0) FAIL(INVALID_ARGUMENT);
  if (!dma && max_transfer_size > SOC_SPI_MAXIMUM_BUFFER_SIZE) FAIL(INVALID_ARGUMENT);

  size_t buffer_alignment = spi_dma_buffer_alignment(dma);
  ASSERT(Utils::is_power_of_two(buffer_alignment));
  size_t driver_max_transfer_size =
      (static_cast<size_t>(max_transfer_size) + buffer_alignment - 1) &
      ~(buffer_alignment - 1);
  if (driver_max_transfer_size < max_transfer_size ||
      driver_max_transfer_size > INT_MAX) FAIL(INVALID_ARGUMENT);

  ByteArray* proxy = process->object_heap()->allocate_proxy();
  if (proxy == null) FAIL(ALLOCATION_FAILED);

  GpioPinReserver reserver;
  bool reserve_ok = true;
  if (mosi < -1 || miso < -1 || clock < 0 || cs < 0) FAIL(INVALID_ARGUMENT);
  int mosi_num = reserver.decode_and_take(mosi, &reserve_ok);
  int miso_num = reserver.decode_and_take(miso, &reserve_ok);
  int clock_num = reserver.decode_and_take(clock, &reserve_ok);
  int cs_num = reserver.decode_and_take(cs, &reserve_ok);
  if (!reserve_ok) FAIL(ALREADY_IN_USE);
  if (clock_num < 0 || cs_num < 0) FAIL(INVALID_ARGUMENT);
  if (mosi_num < 0 && miso_num < 0) FAIL(INVALID_ARGUMENT);
#if CONFIG_IDF_TARGET_ESP32
  if (dma && mosi_num >= 0 && (miso_num >= 0 || (mode & 1) != 0)) {
    FAIL(INVALID_ARGUMENT);
  }
#endif

  spi_host_device_t host_device = spi_host_devices.any();
  if (host_device == kInvalidHostDevice) FAIL(ALREADY_IN_USE);
  bool host_owned = true;
  Defer release_host { [&] {
    if (host_owned) spi_host_devices.put(host_device);
  } };

  QueueHandle_t event_queue = xQueueCreateWithCaps(
      2, sizeof(word), MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT);
  if (event_queue == null) FAIL(MALLOC_FAILED);

  auto resource = _new SpiTargetResource(
      group,
      host_device,
      event_queue,
      max_transfer_size,
      buffer_alignment,
      dma,
      miso_num >= 0);
  if (resource == null) {
    vQueueDeleteWithCaps(event_queue);
    FAIL(MALLOC_FAILED);
  }
  host_owned = false;
  bool registered = false;
  Defer delete_resource { [&] { if (!registered) delete resource; } };

  SpiTargetConfig config = {
    .mosi = mosi_num,
    .miso = miso_num,
    .clock = clock_num,
    .cs = cs_num,
    .max_transfer_size = driver_max_transfer_size,
    .mode = mode,
    .transmit_lsb_first = transmit_lsb_first,
    .receive_lsb_first = receive_lsb_first,
    .dma = dma,
    .armed_callback = spi_target_ready_callback,
    .done_callback = spi_target_done_callback,
  };
  esp_err_t err = resource->initialize_driver(config);
  if (err != ESP_OK) return Primitive::os_error(err, process);

  resource->owned_pins().adopt(reserver);
  reserver.keep();
  group->register_resource(resource);
  proxy->set_external_address(resource);
  registered = true;
  return proxy;
}

PRIMITIVE(target_close) {
  ARGS(SpiTargetResourceGroup, group, SpiTargetResource, resource);
  if (resource->operation_in_flight()) FAIL(INVALID_STATE);
  group->unregister_resource(resource);
  resource_proxy->clear_external_address();
  return process->null_object();
}

#ifdef CONFIG_TOIT_ENABLE_SPI_BUFFER_TARGET

SPI_TARGET_ISR_ATTR static void spi_buffer_target_done_callback(
    spi_slave_transaction_t* transaction) {
  auto resource = static_cast<SpiBufferTargetResource*>(transaction->user);
  resource->complete_from_isr();
}

SPI_TARGET_ISR_ATTR static void spi_buffer_target_armed_callback(
    spi_slave_transaction_t* transaction) {
  auto resource = static_cast<SpiBufferTargetResource*>(transaction->user);
  resource->armed_from_isr();
}

PRIMITIVE(buffer_target_create) {
  ARGS(SpiTargetResourceGroup, group,
       int, mosi,
       int, miso,
       int, clock,
       int, cs,
       int, mode,
       bool, transmit_lsb_first,
       bool, receive_lsb_first,
       uint32, receive_queue_depth,
       Blob, response,
       bool, dma);

  size_t buffer_size = response.length();
  if (mode < 0 || mode > 3 || buffer_size == 0 ||
      buffer_size > kSpiBufferTargetMaxTransferSize ||
      receive_queue_depth == 0) {
    FAIL(INVALID_ARGUMENT);
  }
  if (!dma && buffer_size > SOC_SPI_MAXIMUM_BUFFER_SIZE) FAIL(INVALID_ARGUMENT);

  size_t buffer_alignment = spi_dma_buffer_alignment(dma);
  ASSERT(Utils::is_power_of_two(buffer_alignment));
  size_t driver_buffer_size =
      (buffer_size + buffer_alignment - 1) & ~(buffer_alignment - 1);
  if (driver_buffer_size < buffer_size || driver_buffer_size > INT_MAX) {
    FAIL(INVALID_ARGUMENT);
  }
  if (receive_queue_depth == UINT32_MAX) FAIL(INVALID_ARGUMENT);
  size_t receive_buffer_count = static_cast<size_t>(receive_queue_depth) + 1;
  if (driver_buffer_size > SIZE_MAX / receive_buffer_count) FAIL(INVALID_ARGUMENT);
  size_t receive_storage_size = driver_buffer_size * receive_buffer_count;
  if (receive_queue_depth > SIZE_MAX / sizeof(uint32_t)) FAIL(INVALID_ARGUMENT);

  ByteArray* proxy = process->object_heap()->allocate_proxy();
  if (proxy == null) FAIL(ALLOCATION_FAILED);

  GpioPinReserver reserver;
  bool reserve_ok = true;
  if (mosi < -1 || miso < -1 || clock < 0 || cs < 0) FAIL(INVALID_ARGUMENT);
  int mosi_num = reserver.decode_and_take(mosi, &reserve_ok);
  int miso_num = reserver.decode_and_take(miso, &reserve_ok);
  int clock_num = reserver.decode_and_take(clock, &reserve_ok);
  int cs_num = reserver.decode_and_take(cs, &reserve_ok);
  if (!reserve_ok) FAIL(ALREADY_IN_USE);
  if (clock_num < 0 || cs_num < 0) FAIL(INVALID_ARGUMENT);
  if (mosi_num < 0 && miso_num < 0) FAIL(INVALID_ARGUMENT);
#if CONFIG_IDF_TARGET_ESP32
  if (dma && mosi_num >= 0 && (miso_num >= 0 || (mode & 1) != 0)) {
    FAIL(INVALID_ARGUMENT);
  }
#endif

  spi_host_device_t host_device = spi_host_devices.any();
  if (host_device == kInvalidHostDevice) FAIL(ALREADY_IN_USE);
  bool host_owned = true;
  Defer release_host { [&] {
    if (host_owned) spi_host_devices.put(host_device);
  } };

  uint8_t* response_buffer = miso_num < 0
      ? null
      : allocate_dma_buffer(driver_buffer_size, buffer_alignment);
  if (miso_num >= 0 && response_buffer == null) FAIL(MALLOC_FAILED);
  Defer free_response { [&] { if (host_owned) free(response_buffer); } };
  if (response_buffer != null) {
    memcpy(response_buffer, response.address(), buffer_size);
    memset(response_buffer + buffer_size, 0xff, driver_buffer_size - buffer_size);
  }

