toitlang/toit/src/resources/spi_esp32.cc
  // One buffer is mounted for the next transaction. The remaining buffers are
  // either free or hold completed transactions until Toit consumes them. The
  // completion callback rotates pointers instead of copying up to 4092 bytes
  // while the peripheral is unarmed.
  uint8_t* receive_storage = mosi_num < 0
      ? null
      : allocate_dma_buffer(receive_storage_size, buffer_alignment);
  if (mosi_num >= 0 && receive_storage == null) FAIL(MALLOC_FAILED);
  Defer free_receive_storage { [&] { if (host_owned) free(receive_storage); } };
#if SOC_CACHE_INTERNAL_MEM_VIA_L1CACHE
  if (dma && receive_storage != null) {
    // Only the initially mounted buffer passes through
    // spi_slave_setup_priv_trans. The other aligned slices are first queued
    // from the completion ISR, so invalidate the complete storage now before
    // DMA can ever own one of them. Toit only reads the slices afterwards and
    // therefore does not make them dirty before they are reused.
    esp_err_t sync_error = esp_cache_msync(
        receive_storage,
        receive_storage_size,
        ESP_CACHE_MSYNC_FLAG_DIR_M2C);
    if (sync_error != ESP_OK) return Primitive::os_error(sync_error, process);
  }
#endif

  uint32_t* receive_indices = mosi_num < 0
      ? null
      : static_cast<uint32_t*>(heap_caps_malloc(
          receive_queue_depth * sizeof(uint32_t),
          MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT));
  if (mosi_num >= 0 && receive_indices == null) FAIL(MALLOC_FAILED);
  Defer free_indices { [&] { if (host_owned) free(receive_indices); } };

  uint32_t* receive_lengths = mosi_num < 0
      ? null
      : static_cast<uint32_t*>(heap_caps_calloc(
          receive_queue_depth,
          sizeof(uint32_t),
          MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT));
  if (mosi_num >= 0 && receive_lengths == null) FAIL(MALLOC_FAILED);
  Defer free_lengths { [&] { if (host_owned) free(receive_lengths); } };

  uint32_t* free_receive_indices = mosi_num < 0
      ? null
      : static_cast<uint32_t*>(heap_caps_malloc(
          receive_queue_depth * sizeof(uint32_t),
          MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT));
  if (mosi_num >= 0 && free_receive_indices == null) FAIL(MALLOC_FAILED);
  Defer free_free_indices { [&] {
    if (host_owned) free(free_receive_indices);
  } };

  QueueHandle_t event_queue = xQueueCreateWithCaps(
      1, sizeof(word), MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT);
  if (event_queue == null) FAIL(MALLOC_FAILED);
  Defer delete_queue { [&] { if (host_owned) vQueueDeleteWithCaps(event_queue); } };

  auto resource = _new SpiBufferTargetResource(
      group,
      host_device,
      event_queue,
      response_buffer,
      receive_storage,
      receive_indices,
      receive_lengths,
      free_receive_indices,
      buffer_size,
      driver_buffer_size,
      receive_queue_depth,
      dma);
  if (resource == null) FAIL(MALLOC_FAILED);
  host_owned = false;
  bool registered = false;
  Defer delete_resource { [&] { if (!registered) delete resource; } };

  SpiTargetConfig config = {
    .mosi = mosi_num,
    .miso = miso_num,
    .clock = clock_num,
    .cs = cs_num,
    .max_transfer_size = driver_buffer_size,
    .mode = mode,
    .transmit_lsb_first = transmit_lsb_first,
    .receive_lsb_first = receive_lsb_first,
    .dma = dma,
    .armed_callback = spi_buffer_target_armed_callback,
    .done_callback = spi_buffer_target_done_callback,
  };
  esp_err_t err = resource->initialize_driver(config);
  if (err != ESP_OK) return Primitive::os_error(err, process);

  resource->owned_pins().adopt(reserver);
  reserver.keep();
  group->register_resource(resource);
  proxy->set_external_address(resource);
  registered = true;
  return proxy;
}

PRIMITIVE(buffer_target_arm) {
  ARGS(SpiBufferTargetResource, target);
  esp_err_t err = spi_slave_queue_trans(
      target->host_device(), target->transaction(), 0);
  if (err != ESP_OK) return Primitive::os_error(err, process);
  return process->null_object();
}

PRIMITIVE(buffer_target_close) {
  ARGS(SpiTargetResourceGroup, group, SpiBufferTargetResource, target, bool, abort);
  if (abort) {
    return target->request_abort()
        ? process->true_object()
        : process->false_object();
  }
  group->unregister_resource(target);
  target_proxy->clear_external_address();
  return process->null_object();
}

PRIMITIVE(buffer_target_get) {
  ARGS(SpiBufferTargetResource, target, uint32, index);
  if (!target->can_transmit()) FAIL(INVALID_STATE);
  if (index >= target->buffer_size()) FAIL(OUT_OF_BOUNDS);
  return Smi::from(target->get_response(index));
}

PRIMITIVE(buffer_target_set) {
  ARGS(SpiBufferTargetResource, target, uint32, index, uint8, value);
  if (!target->can_transmit()) FAIL(INVALID_STATE);
  if (index >= target->buffer_size()) FAIL(OUT_OF_BOUNDS);
  target->set_response(index, value);
  return Smi::from(value);
}

PRIMITIVE(buffer_target_read) {
  ARGS(SpiBufferTargetResource, target, uint32, index, MutableBlob, result);
  if (!target->can_transmit()) FAIL(INVALID_STATE);
  if (index > target->buffer_size() ||
      result.length() > target->buffer_size() - index) FAIL(OUT_OF_BOUNDS);
  target->read_response(index, result.address(), result.length());
  return process->null_object();
}

PRIMITIVE(buffer_target_write) {
  ARGS(SpiBufferTargetResource, target, uint32, index, Blob, bytes);
  if (!target->can_transmit()) FAIL(INVALID_STATE);
  if (index > target->buffer_size() ||
      bytes.length() > target->buffer_size() - index) FAIL(OUT_OF_BOUNDS);
  target->write_response(index, bytes.address(), bytes.length());
  return process->null_object();
}

PRIMITIVE(buffer_target_receive) {
  ARGS(SpiBufferTargetResource, target, MutableBlob, result);
  if (!target->can_receive()) FAIL(INVALID_STATE);
  if (result.length() < target->buffer_size()) FAIL(OUT_OF_BOUNDS);
  int received = target->take_receive(result.address());
  if (received == -2) FAIL(INVALID_STATE);
  return Smi::from(received);
}

PRIMITIVE(buffer_target_dropped_receive_count) {
  ARGS(SpiBufferTargetResource, target);
  return Smi::from(target->dropped_receive_count());
}

#else

PRIMITIVE(buffer_target_create)                { FAIL(UNIMPLEMENTED); }
PRIMITIVE(buffer_target_arm)                   { FAIL(UNIMPLEMENTED); }
PRIMITIVE(buffer_target_close)                 { FAIL(UNIMPLEMENTED); }
PRIMITIVE(buffer_target_get)                   { FAIL(UNIMPLEMENTED); }
PRIMITIVE(buffer_target_set)                   { FAIL(UNIMPLEMENTED); }
PRIMITIVE(buffer_target_read)                  { FAIL(UNIMPLEMENTED); }
PRIMITIVE(buffer_target_write)                 { FAIL(UNIMPLEMENTED); }
PRIMITIVE(buffer_target_receive)               { FAIL(UNIMPLEMENTED); }
PRIMITIVE(buffer_target_dropped_receive_count) { FAIL(UNIMPLEMENTED); }

#endif  // CONFIG_TOIT_ENABLE_SPI_BUFFER_TARGET

PRIMITIVE(target_transfer_start) {
  ARGS(SpiTargetResource, resource,
       Blob, transmit,
       uint32, receive_size,
       uint8, fill_byte);
  if (resource->operation_in_flight()) FAIL(INVALID_STATE);

  size_t transmit_size = transmit.length();
  size_t transfer_size = Utils::max(transmit_size, static_cast<size_t>(receive_size));
  if (transfer_size == 0 || transfer_size > resource->max_transfer_size()) {
    FAIL(INVALID_ARGUMENT);
  }
  size_t alignment = resource->buffer_alignment();
  size_t driver_transfer_size =
      (transfer_size + alignment - 1) & ~(alignment - 1);
  ASSERT(driver_transfer_size >= transfer_size);

  uint8_t* tx_buffer = resource->transmit_enabled()
      ? allocate_dma_buffer(driver_transfer_size, alignment)
      : null;
  if (resource->transmit_enabled() && tx_buffer == null) {
    return Primitive::os_error(ESP_ERR_NO_MEM, process);
  }
  bool buffers_handed_to_resource = false;
  Defer free_buffers { [&] {
    if (!buffers_handed_to_resource) free(tx_buffer);
  } };
  if (tx_buffer != null) {
    memset(tx_buffer, fill_byte, driver_transfer_size);
    memcpy(tx_buffer, transmit.address(), transmit_size);
  }

