toitlang/toit/src/resources/spi_esp32.cc
  // The driver programs one length for both directions. Even when the caller
  // only wants a prefix of the received data, DMA may write the full transfer.
  uint8_t* rx_buffer = allocate_dma_buffer(
      receive_size == 0 ? 0 : driver_transfer_size, alignment);
  if (receive_size != 0 && rx_buffer == null) {
    return Primitive::os_error(ESP_ERR_NO_MEM, process);
  }
  Defer free_receive_buffer { [&] {
    if (!buffers_handed_to_resource) free(rx_buffer);
  } };

  resource->prepare_operation(
      tx_buffer, rx_buffer, receive_size, driver_transfer_size);
  buffers_handed_to_resource = true;
  bool dispatched = false;
  Defer cancel_operation { [&] {
    if (!dispatched) resource->finish_operation();
  } };

  esp_err_t err = spi_slave_queue_trans(
      resource->host_device(), resource->transaction(), 0);
  if (err != ESP_OK) return Primitive::os_error(err, process);
  dispatched = true;
  return process->null_object();
}

PRIMITIVE(target_transfer_finish) {
  ARGS(SpiTargetResource, resource, MutableBlob, receive_buffer, bool, abort);
  if (!resource->operation_in_flight()) FAIL(INVALID_STATE);

  if (abort) {
    esp_err_t err = spi_slave_abort_transaction(
        resource->host_device(), resource->transaction());
    if (err == ESP_ERR_INVALID_STATE) {
      // Natural completion won the race. Its callback supplies the DONE event
      // that lets the Toit cleanup path synchronize before freeing buffers.
      return process->false_object();
    }
    // A target always has a CS pin, and the transaction has been mounted before
    // Toit can request an abort. Other errors indicate a driver invariant broke.
    FATAL_IF_NOT_ESP_OK(err);
    return process->true_object();
  }

  if (receive_buffer.length() < resource->receive_size()) FAIL(OUT_OF_BOUNDS);

  size_t transferred_bytes = (resource->transferred_bits() + 7) / 8;
#if CONFIG_IDF_TARGET_ESP32
  // Classic ESP32 target DMA only commits complete words to its receive
  // buffer. ESP-IDF documents that a controller's trailing bytes are
  // discarded when its transaction length is not a multiple of four.
  if (resource->dma()) transferred_bytes &= ~static_cast<size_t>(3);
#endif
  size_t result_size = Utils::min(transferred_bytes, resource->receive_size());
  if (result_size != 0) {
    memcpy(receive_buffer.address(), resource->receive_buffer(), result_size);
  }
  resource->finish_operation();
  return Smi::from(result_size);
}

#else

PRIMITIVE(target_init)                         { FAIL(UNIMPLEMENTED); }
PRIMITIVE(target_create)                       { FAIL(UNIMPLEMENTED); }
PRIMITIVE(target_close)                        { FAIL(UNIMPLEMENTED); }
PRIMITIVE(target_transfer_start)               { FAIL(UNIMPLEMENTED); }
PRIMITIVE(target_transfer_finish)              { FAIL(UNIMPLEMENTED); }
PRIMITIVE(buffer_target_create)                { FAIL(UNIMPLEMENTED); }
PRIMITIVE(buffer_target_arm)                   { FAIL(UNIMPLEMENTED); }
PRIMITIVE(buffer_target_close)                 { FAIL(UNIMPLEMENTED); }
PRIMITIVE(buffer_target_get)                   { FAIL(UNIMPLEMENTED); }
PRIMITIVE(buffer_target_set)                   { FAIL(UNIMPLEMENTED); }
PRIMITIVE(buffer_target_read)                  { FAIL(UNIMPLEMENTED); }
PRIMITIVE(buffer_target_write)                 { FAIL(UNIMPLEMENTED); }
PRIMITIVE(buffer_target_receive)               { FAIL(UNIMPLEMENTED); }
PRIMITIVE(buffer_target_dropped_receive_count) { FAIL(UNIMPLEMENTED); }

#endif  // CONFIG_TOIT_ENABLE_SPI_TARGET

PRIMITIVE(close) {
  ARGS(SpiResourceGroup, spi);
  spi->tear_down();
  spi_proxy->clear_external_address();
  return process->null_object();
}

SPI_CONTROLLER_ISR_ATTR static void spi_post_transfer_callback(spi_transaction_t* t) {
  auto resource = static_cast<SpiDevice*>(t->user);
  resource->complete_from_isr();
}

PRIMITIVE(device) {
  ARGS(SpiResourceGroup, spi,
       int, cs,
       int, dc,
       int, command_bits,
       int, address_bits,
       int, frequency,
       int, mode,
       int, cs_setup_cycles,
       int, cs_hold_cycles);

  if (cs_setup_cycles < 0 || cs_setup_cycles > 16 ||
      cs_hold_cycles < 0 || cs_hold_cycles > 16) FAIL(INVALID_ARGUMENT);
  if (!spi->can_add_device()) FAIL(ALREADY_IN_USE);

  ByteArray* proxy = process->object_heap()->allocate_proxy();
  if (proxy == null) FAIL(ALLOCATION_FAILED);

  // Decode the pins and reserve them from the shared
  // pool. The reserver releases everything again if we leave without `keep()`.
  GpioPinReserver reserver;
  bool reserve_ok = true;
  int cs_num = reserver.decode_and_take(cs, &reserve_ok);
  bool dc_owned = false;
  int dc_num = reserver.decode_and_take(dc, &reserve_ok, &dc_owned);
  if (!reserve_ok) FAIL(ALREADY_IN_USE);

  // The dc pin is toggled in software, so it must be an output. We configure it
  // here when we reserved it. A deprecated gpio.Pin (old API) is configured on
  // the Toit side instead.
  if (dc_owned) {
    gpio_config_t dc_cfg = {
      .pin_bit_mask = 1ULL << dc_num,
      .mode = GPIO_MODE_OUTPUT,
      .pull_up_en = GPIO_PULLUP_DISABLE,
      .pull_down_en = GPIO_PULLDOWN_DISABLE,
      .intr_type = GPIO_INTR_DISABLE,
    };
    esp_err_t cfg_err = gpio_config(&dc_cfg);
    if (cfg_err != ESP_OK) return Primitive::os_error(cfg_err, process);
  }

  spi_device_interface_config_t conf = {
    .command_bits     = uint8(command_bits),
    .address_bits     = uint8(address_bits),
    .dummy_bits       = 0,
    .mode             = uint8(mode),
    .clock_source     = SPI_CLK_SRC_DEFAULT,
    .duty_cycle_pos   = 0,
    .cs_ena_pretrans  = static_cast<uint16_t>(cs_setup_cycles),
    .cs_ena_posttrans = static_cast<uint8_t>(cs_hold_cycles),
    .clock_speed_hz   = frequency,
    .input_delay_ns   = 0,
    .sample_point     = SPI_SAMPLING_POINT_PHASE_0,
    .spics_io_num     = cs_num,
    .flags            = spi->half_duplex()
        ? static_cast<uint32_t>(SPI_DEVICE_HALFDUPLEX)
        : 0u,
    .queue_size       = 1,
    .pre_cb           = null,
    .post_cb          = spi_post_transfer_callback,
  };
  QueueHandle_t event_queue = xQueueCreateWithCaps(
      1, sizeof(word), MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT);
  if (event_queue == null) FAIL(MALLOC_FAILED);
  bool queue_handed_to_resource = false;
  Defer delete_queue { [&] {
    if (!queue_handed_to_resource) vQueueDeleteWithCaps(event_queue);
  } };

  spi_device_handle_t device;
  esp_err_t err = spi_bus_add_device(spi->host_device(), &conf, &device);
  if (err != ESP_OK) {
    return Primitive::os_error(err, process);
  }

  SpiDevice* spi_device = _new SpiDevice(spi, device, event_queue, dc_num);
  if (spi_device == null) {
    spi_bus_remove_device(device);
    FAIL(MALLOC_FAILED);
  }
  queue_handed_to_resource = true;

  // The reservation now belongs to the resource and is released on close.
  spi_device->owned_pins().adopt(reserver);
  reserver.keep();

  spi->register_resource(spi_device);
  proxy->set_external_address(spi_device);
  return proxy;
}

