toitlang/toit/src/resources/spi_esp32.cc
PRIMITIVE(device_close) {
  ARGS(SpiResourceGroup, spi, SpiDevice, device);
  spi->unregister_resource(device);
  device_proxy->clear_external_address();
  return process->null_object();
}

PRIMITIVE(transfer_start) {
  ARGS(SpiDevice, device, MutableBlob, tx, int, command, int64, address, int, from, int, to, bool, read, int, dc, bool, keep_cs_active);

  if (from < 0 || from > to || to > tx.length()) FAIL(OUT_OF_BOUNDS);
  if (device->operation_in_flight()) FAIL(INVALID_STATE);

  size_t length = to - from;

  uint32_t flags = 0;
  if (keep_cs_active) flags |= SPI_TRANS_CS_KEEP_ACTIVE;

  // Use the driver's inline storage to avoid a native allocation for the
  // common 1-4 byte case. The descriptor remains alive until transfer_finish
  // retires it.
  bool use_inline_tx = length != 0 && length <= SpiDevice::INLINE_TX_SIZE;
  const uint8_t* tx_data = length == 0 ? null : tx.address() + from;
  uint8_t* tx_buffer = use_inline_tx ? null : allocate_dma_buffer(length, 4);
  if (length != 0 && !use_inline_tx && tx_buffer == null) {
    return Primitive::os_error(ESP_ERR_NO_MEM, process);
  }
  bool buffers_handed_to_resource = false;
  Defer free_tx_buffer { [&] {
    if (!buffers_handed_to_resource) free(tx_buffer);
  } };
  if (length != 0 && !use_inline_tx) {
    memcpy(tx_buffer, tx_data, length);
  }

  if (device->dc() != -1) {
    gpio_set_level(static_cast<gpio_num_t>(device->dc()), dc);
  }

  uint8_t* rx_buffer = read ? allocate_dma_buffer(length, 4) : null;
  if (read && length != 0 && rx_buffer == null) {
    return Primitive::os_error(ESP_ERR_NO_MEM, process);
  }
  Defer free_rx_buffer { [&] {
    if (!buffers_handed_to_resource) free(rx_buffer);
  } };

  device->prepare_operation(
      tx_data,
      tx_buffer,
      rx_buffer,
      length,
      flags,
      static_cast<uint16_t>(command),
      static_cast<uint64_t>(address));
  buffers_handed_to_resource = true;
  bool queued = false;
  Defer cancel_operation { [&] {
    if (!queued) device->finish_operation();
  } };

  esp_err_t err = spi_device_queue_trans(
      device->handle(), device->transaction(), 0);
  if (err != ESP_OK) return Primitive::os_error(err, process);
  queued = true;
  return process->null_object();
}

PRIMITIVE(transfer_finish) {
  ARGS(SpiDevice, device, MutableBlob, data, int, from, bool, read);
  if (!device->operation_in_flight()) FAIL(INVALID_STATE);

  size_t length = device->transfer_size();
  if (from < 0 || static_cast<size_t>(from) > data.length() ||
      length > data.length() - from) FAIL(OUT_OF_BOUNDS);

  spi_transaction_t* completed = null;
  esp_err_t err = spi_device_get_trans_result(
      device->handle(), &completed, 0);
  if (err == ESP_ERR_TIMEOUT) return process->false_object();
  if (err != ESP_OK) return Primitive::os_error(err, process);
  ASSERT(completed == device->transaction());

  if (read && length != 0) {
    memcpy(data.address() + from, device->receive_buffer(), length);
  }
  device->finish_operation();
  return process->true_object();
}

PRIMITIVE(transfer_abort) {
  ARGS(SpiDevice, device);
  // ESP-IDF cannot abort controller transactions. Keep ownership until finish
  // has drained the return queue, including when the callback already ran.
  return BOOL(!device->operation_in_flight());
}

PRIMITIVE(acquire_bus) {
  ARGS(SpiDevice, device);
  esp_err_t err = spi_device_try_acquire_bus(device->handle());
  if (err == ESP_ERR_TIMEOUT) return process->false_object();
  if (err != ESP_OK) {
    return Primitive::os_error(err, process);
  }
  device->set_bus_acquired(true);
  return process->true_object();
}

PRIMITIVE(release_bus) {
  ARGS(SpiDevice, device);
  spi_device_release_bus(device->handle());
  device->set_bus_acquired(false);
  return process->null_object();
}

} // namespace toit

#endif // TOIT_ESP32
